RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/ef_data_reg.h
/**
  ******************************************************************************
  * @file    EF_DATA_reg.h
  * @version V1.2
  * @date    2019-11-22
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2019 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef __EF_DATA_REG_H__
#define __EF_DATA_REG_H__

#include "bl602.h"

/* 0x0 : ef_cfg_0 */
#define EF_DATA_EF_CFG_0_OFFSET         (0x0)
#define EF_DATA_EF_SF_AES_MODE          EF_DATA_EF_SF_AES_MODE
#define EF_DATA_EF_SF_AES_MODE_POS      (0U)
#define EF_DATA_EF_SF_AES_MODE_LEN      (2U)
#define EF_DATA_EF_SF_AES_MODE_MSK      (((1U << EF_DATA_EF_SF_AES_MODE_LEN) - 1) << EF_DATA_EF_SF_AES_MODE_POS)
#define EF_DATA_EF_SF_AES_MODE_UMSK     (~(((1U << EF_DATA_EF_SF_AES_MODE_LEN) - 1) << EF_DATA_EF_SF_AES_MODE_POS))
#define EF_DATA_EF_SBOOT_SIGN_MODE      EF_DATA_EF_SBOOT_SIGN_MODE
#define EF_DATA_EF_SBOOT_SIGN_MODE_POS  (2U)
#define EF_DATA_EF_SBOOT_SIGN_MODE_LEN  (2U)
#define EF_DATA_EF_SBOOT_SIGN_MODE_MSK  (((1U << EF_DATA_EF_SBOOT_SIGN_MODE_LEN) - 1) << EF_DATA_EF_SBOOT_SIGN_MODE_POS)
#define EF_DATA_EF_SBOOT_SIGN_MODE_UMSK (~(((1U << EF_DATA_EF_SBOOT_SIGN_MODE_LEN) - 1) << EF_DATA_EF_SBOOT_SIGN_MODE_POS))
#define EF_DATA_EF_SBOOT_EN             EF_DATA_EF_SBOOT_EN
#define EF_DATA_EF_SBOOT_EN_POS         (4U)
#define EF_DATA_EF_SBOOT_EN_LEN         (2U)
#define EF_DATA_EF_SBOOT_EN_MSK         (((1U << EF_DATA_EF_SBOOT_EN_LEN) - 1) << EF_DATA_EF_SBOOT_EN_POS)
#define EF_DATA_EF_SBOOT_EN_UMSK        (~(((1U << EF_DATA_EF_SBOOT_EN_LEN) - 1) << EF_DATA_EF_SBOOT_EN_POS))
#define EF_DATA_EF_CPU0_ENC_EN          EF_DATA_EF_CPU0_ENC_EN
#define EF_DATA_EF_CPU0_ENC_EN_POS      (7U)
#define EF_DATA_EF_CPU0_ENC_EN_LEN      (1U)
#define EF_DATA_EF_CPU0_ENC_EN_MSK      (((1U << EF_DATA_EF_CPU0_ENC_EN_LEN) - 1) << EF_DATA_EF_CPU0_ENC_EN_POS)
#define EF_DATA_EF_CPU0_ENC_EN_UMSK     (~(((1U << EF_DATA_EF_CPU0_ENC_EN_LEN) - 1) << EF_DATA_EF_CPU0_ENC_EN_POS))
#define EF_DATA_EF_TRIM_EN              EF_DATA_EF_TRIM_EN
#define EF_DATA_EF_TRIM_EN_POS          (12U)
#define EF_DATA_EF_TRIM_EN_LEN          (1U)
#define EF_DATA_EF_TRIM_EN_MSK          (((1U << EF_DATA_EF_TRIM_EN_LEN) - 1) << EF_DATA_EF_TRIM_EN_POS)
#define EF_DATA_EF_TRIM_EN_UMSK         (~(((1U << EF_DATA_EF_TRIM_EN_LEN) - 1) << EF_DATA_EF_TRIM_EN_POS))
#define EF_DATA_EF_NO_HD_BOOT_EN        EF_DATA_EF_NO_HD_BOOT_EN
#define EF_DATA_EF_NO_HD_BOOT_EN_POS    (13U)
#define EF_DATA_EF_NO_HD_BOOT_EN_LEN    (1U)
#define EF_DATA_EF_NO_HD_BOOT_EN_MSK    (((1U << EF_DATA_EF_NO_HD_BOOT_EN_LEN) - 1) << EF_DATA_EF_NO_HD_BOOT_EN_POS)
#define EF_DATA_EF_NO_HD_BOOT_EN_UMSK   (~(((1U << EF_DATA_EF_NO_HD_BOOT_EN_LEN) - 1) << EF_DATA_EF_NO_HD_BOOT_EN_POS))
#define EF_DATA_EF_0_KEY_ENC_EN         EF_DATA_EF_0_KEY_ENC_EN
#define EF_DATA_EF_0_KEY_ENC_EN_POS     (17U)
#define EF_DATA_EF_0_KEY_ENC_EN_LEN     (1U)
#define EF_DATA_EF_0_KEY_ENC_EN_MSK     (((1U << EF_DATA_EF_0_KEY_ENC_EN_LEN) - 1) << EF_DATA_EF_0_KEY_ENC_EN_POS)
#define EF_DATA_EF_0_KEY_ENC_EN_UMSK    (~(((1U << EF_DATA_EF_0_KEY_ENC_EN_LEN) - 1) << EF_DATA_EF_0_KEY_ENC_EN_POS))
#define EF_DATA_EF_DBG_JTAG_0_DIS       EF_DATA_EF_DBG_JTAG_0_DIS
#define EF_DATA_EF_DBG_JTAG_0_DIS_POS   (26U)
#define EF_DATA_EF_DBG_JTAG_0_DIS_LEN   (2U)
#define EF_DATA_EF_DBG_JTAG_0_DIS_MSK   (((1U << EF_DATA_EF_DBG_JTAG_0_DIS_LEN) - 1) << EF_DATA_EF_DBG_JTAG_0_DIS_POS)
#define EF_DATA_EF_DBG_JTAG_0_DIS_UMSK  (~(((1U << EF_DATA_EF_DBG_JTAG_0_DIS_LEN) - 1) << EF_DATA_EF_DBG_JTAG_0_DIS_POS))
#define EF_DATA_EF_DBG_MODE             EF_DATA_EF_DBG_MODE
#define EF_DATA_EF_DBG_MODE_POS         (28U)
#define EF_DATA_EF_DBG_MODE_LEN         (4U)
#define EF_DATA_EF_DBG_MODE_MSK         (((1U << EF_DATA_EF_DBG_MODE_LEN) - 1) << EF_DATA_EF_DBG_MODE_POS)
#define EF_DATA_EF_DBG_MODE_UMSK        (~(((1U << EF_DATA_EF_DBG_MODE_LEN) - 1) << EF_DATA_EF_DBG_MODE_POS))

/* 0x4 : ef_dbg_pwd_low */
#define EF_DATA_EF_DBG_PWD_LOW_OFFSET (0x4)
#define EF_DATA_EF_DBG_PWD_LOW        EF_DATA_EF_DBG_PWD_LOW
#define EF_DATA_EF_DBG_PWD_LOW_POS    (0U)
#define EF_DATA_EF_DBG_PWD_LOW_LEN    (32U)
#define EF_DATA_EF_DBG_PWD_LOW_MSK    (((1U << EF_DATA_EF_DBG_PWD_LOW_LEN) - 1) << EF_DATA_EF_DBG_PWD_LOW_POS)
#define EF_DATA_EF_DBG_PWD_LOW_UMSK   (~(((1U << EF_DATA_EF_DBG_PWD_LOW_LEN) - 1) << EF_DATA_EF_DBG_PWD_LOW_POS))

