RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/include/hardware/ef_data_reg.h
/* 0x8 : ef_dbg_pwd_high */
#define EF_DATA_EF_DBG_PWD_HIGH_OFFSET (0x8)
#define EF_DATA_EF_DBG_PWD_HIGH        EF_DATA_EF_DBG_PWD_HIGH
#define EF_DATA_EF_DBG_PWD_HIGH_POS    (0U)
#define EF_DATA_EF_DBG_PWD_HIGH_LEN    (32U)
#define EF_DATA_EF_DBG_PWD_HIGH_MSK    (((1U << EF_DATA_EF_DBG_PWD_HIGH_LEN) - 1) << EF_DATA_EF_DBG_PWD_HIGH_POS)
#define EF_DATA_EF_DBG_PWD_HIGH_UMSK   (~(((1U << EF_DATA_EF_DBG_PWD_HIGH_LEN) - 1) << EF_DATA_EF_DBG_PWD_HIGH_POS))

/* 0xC : ef_ana_trim_0 */
#define EF_DATA_EF_ANA_TRIM_0_OFFSET (0xC)
#define EF_DATA_EF_ANA_TRIM_0        EF_DATA_EF_ANA_TRIM_0
#define EF_DATA_EF_ANA_TRIM_0_POS    (0U)
#define EF_DATA_EF_ANA_TRIM_0_LEN    (32U)
#define EF_DATA_EF_ANA_TRIM_0_MSK    (((1U << EF_DATA_EF_ANA_TRIM_0_LEN) - 1) << EF_DATA_EF_ANA_TRIM_0_POS)
#define EF_DATA_EF_ANA_TRIM_0_UMSK   (~(((1U << EF_DATA_EF_ANA_TRIM_0_LEN) - 1) << EF_DATA_EF_ANA_TRIM_0_POS))

/* 0x10 : ef_sw_usage_0 */
#define EF_DATA_EF_SW_USAGE_0_OFFSET (0x10)
#define EF_DATA_EF_SW_USAGE_0        EF_DATA_EF_SW_USAGE_0
#define EF_DATA_EF_SW_USAGE_0_POS    (0U)
#define EF_DATA_EF_SW_USAGE_0_LEN    (32U)
#define EF_DATA_EF_SW_USAGE_0_MSK    (((1U << EF_DATA_EF_SW_USAGE_0_LEN) - 1) << EF_DATA_EF_SW_USAGE_0_POS)
#define EF_DATA_EF_SW_USAGE_0_UMSK   (~(((1U << EF_DATA_EF_SW_USAGE_0_LEN) - 1) << EF_DATA_EF_SW_USAGE_0_POS))

/* 0x14 : ef_wifi_mac_low */
#define EF_DATA_EF_WIFI_MAC_LOW_OFFSET (0x14)
#define EF_DATA_EF_WIFI_MAC_LOW        EF_DATA_EF_WIFI_MAC_LOW
#define EF_DATA_EF_WIFI_MAC_LOW_POS    (0U)
#define EF_DATA_EF_WIFI_MAC_LOW_LEN    (32U)
#define EF_DATA_EF_WIFI_MAC_LOW_MSK    (((1U << EF_DATA_EF_WIFI_MAC_LOW_LEN) - 1) << EF_DATA_EF_WIFI_MAC_LOW_POS)
#define EF_DATA_EF_WIFI_MAC_LOW_UMSK   (~(((1U << EF_DATA_EF_WIFI_MAC_LOW_LEN) - 1) << EF_DATA_EF_WIFI_MAC_LOW_POS))

/* 0x18 : ef_wifi_mac_high */
#define EF_DATA_EF_WIFI_MAC_HIGH_OFFSET (0x18)
#define EF_DATA_EF_WIFI_MAC_HIGH        EF_DATA_EF_WIFI_MAC_HIGH
#define EF_DATA_EF_WIFI_MAC_HIGH_POS    (0U)
#define EF_DATA_EF_WIFI_MAC_HIGH_LEN    (32U)
#define EF_DATA_EF_WIFI_MAC_HIGH_MSK    (((1U << EF_DATA_EF_WIFI_MAC_HIGH_LEN) - 1) << EF_DATA_EF_WIFI_MAC_HIGH_POS)
#define EF_DATA_EF_WIFI_MAC_HIGH_UMSK   (~(((1U << EF_DATA_EF_WIFI_MAC_HIGH_LEN) - 1) << EF_DATA_EF_WIFI_MAC_HIGH_POS))

/* 0x1C : ef_key_slot_0_w0 */
#define EF_DATA_EF_KEY_SLOT_0_W0_OFFSET (0x1C)
#define EF_DATA_EF_KEY_SLOT_0_W0        EF_DATA_EF_KEY_SLOT_0_W0
#define EF_DATA_EF_KEY_SLOT_0_W0_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_0_W0_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_0_W0_MSK    (((1U << EF_DATA_EF_KEY_SLOT_0_W0_LEN) - 1) << EF_DATA_EF_KEY_SLOT_0_W0_POS)
#define EF_DATA_EF_KEY_SLOT_0_W0_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_0_W0_LEN) - 1) << EF_DATA_EF_KEY_SLOT_0_W0_POS))

/* 0x20 : ef_key_slot_0_w1 */
#define EF_DATA_EF_KEY_SLOT_0_W1_OFFSET (0x20)
#define EF_DATA_EF_KEY_SLOT_0_W1        EF_DATA_EF_KEY_SLOT_0_W1
#define EF_DATA_EF_KEY_SLOT_0_W1_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_0_W1_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_0_W1_MSK    (((1U << EF_DATA_EF_KEY_SLOT_0_W1_LEN) - 1) << EF_DATA_EF_KEY_SLOT_0_W1_POS)
#define EF_DATA_EF_KEY_SLOT_0_W1_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_0_W1_LEN) - 1) << EF_DATA_EF_KEY_SLOT_0_W1_POS))

/* 0x24 : ef_key_slot_0_w2 */
#define EF_DATA_EF_KEY_SLOT_0_W2_OFFSET (0x24)
#define EF_DATA_EF_KEY_SLOT_0_W2        EF_DATA_EF_KEY_SLOT_0_W2
#define EF_DATA_EF_KEY_SLOT_0_W2_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_0_W2_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_0_W2_MSK    (((1U << EF_DATA_EF_KEY_SLOT_0_W2_LEN) - 1) << EF_DATA_EF_KEY_SLOT_0_W2_POS)
#define EF_DATA_EF_KEY_SLOT_0_W2_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_0_W2_LEN) - 1) << EF_DATA_EF_KEY_SLOT_0_W2_POS))

/* 0x28 : ef_key_slot_0_w3 */
#define EF_DATA_EF_KEY_SLOT_0_W3_OFFSET (0x28)
#define EF_DATA_EF_KEY_SLOT_0_W3        EF_DATA_EF_KEY_SLOT_0_W3
#define EF_DATA_EF_KEY_SLOT_0_W3_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_0_W3_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_0_W3_MSK    (((1U << EF_DATA_EF_KEY_SLOT_0_W3_LEN) - 1) << EF_DATA_EF_KEY_SLOT_0_W3_POS)
#define EF_DATA_EF_KEY_SLOT_0_W3_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_0_W3_LEN) - 1) << EF_DATA_EF_KEY_SLOT_0_W3_POS))

/* 0x2C : ef_key_slot_1_w0 */
#define EF_DATA_EF_KEY_SLOT_1_W0_OFFSET (0x2C)
#define EF_DATA_EF_KEY_SLOT_1_W0        EF_DATA_EF_KEY_SLOT_1_W0
#define EF_DATA_EF_KEY_SLOT_1_W0_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_1_W0_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_1_W0_MSK    (((1U << EF_DATA_EF_KEY_SLOT_1_W0_LEN) - 1) << EF_DATA_EF_KEY_SLOT_1_W0_POS)
#define EF_DATA_EF_KEY_SLOT_1_W0_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_1_W0_LEN) - 1) << EF_DATA_EF_KEY_SLOT_1_W0_POS))

/* 0x30 : ef_key_slot_1_w1 */
#define EF_DATA_EF_KEY_SLOT_1_W1_OFFSET (0x30)
#define EF_DATA_EF_KEY_SLOT_1_W1        EF_DATA_EF_KEY_SLOT_1_W1
#define EF_DATA_EF_KEY_SLOT_1_W1_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_1_W1_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_1_W1_MSK    (((1U << EF_DATA_EF_KEY_SLOT_1_W1_LEN) - 1) << EF_DATA_EF_KEY_SLOT_1_W1_POS)
#define EF_DATA_EF_KEY_SLOT_1_W1_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_1_W1_LEN) - 1) << EF_DATA_EF_KEY_SLOT_1_W1_POS))

/* 0x34 : ef_key_slot_1_w2 */
#define EF_DATA_EF_KEY_SLOT_1_W2_OFFSET (0x34)
#define EF_DATA_EF_KEY_SLOT_1_W2        EF_DATA_EF_KEY_SLOT_1_W2
#define EF_DATA_EF_KEY_SLOT_1_W2_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_1_W2_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_1_W2_MSK    (((1U << EF_DATA_EF_KEY_SLOT_1_W2_LEN) - 1) << EF_DATA_EF_KEY_SLOT_1_W2_POS)
#define EF_DATA_EF_KEY_SLOT_1_W2_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_1_W2_LEN) - 1) << EF_DATA_EF_KEY_SLOT_1_W2_POS))

/* 0x38 : ef_key_slot_1_w3 */
#define EF_DATA_EF_KEY_SLOT_1_W3_OFFSET (0x38)
#define EF_DATA_EF_KEY_SLOT_1_W3        EF_DATA_EF_KEY_SLOT_1_W3
#define EF_DATA_EF_KEY_SLOT_1_W3_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_1_W3_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_1_W3_MSK    (((1U << EF_DATA_EF_KEY_SLOT_1_W3_LEN) - 1) << EF_DATA_EF_KEY_SLOT_1_W3_POS)
#define EF_DATA_EF_KEY_SLOT_1_W3_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_1_W3_LEN) - 1) << EF_DATA_EF_KEY_SLOT_1_W3_POS))

/* 0x3C : ef_key_slot_2_w0 */
#define EF_DATA_EF_KEY_SLOT_2_W0_OFFSET (0x3C)
#define EF_DATA_EF_KEY_SLOT_2_W0        EF_DATA_EF_KEY_SLOT_2_W0
#define EF_DATA_EF_KEY_SLOT_2_W0_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_2_W0_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_2_W0_MSK    (((1U << EF_DATA_EF_KEY_SLOT_2_W0_LEN) - 1) << EF_DATA_EF_KEY_SLOT_2_W0_POS)
#define EF_DATA_EF_KEY_SLOT_2_W0_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_2_W0_LEN) - 1) << EF_DATA_EF_KEY_SLOT_2_W0_POS))

/* 0x40 : ef_key_slot_2_w1 */
#define EF_DATA_EF_KEY_SLOT_2_W1_OFFSET (0x40)
#define EF_DATA_EF_KEY_SLOT_2_W1        EF_DATA_EF_KEY_SLOT_2_W1
#define EF_DATA_EF_KEY_SLOT_2_W1_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_2_W1_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_2_W1_MSK    (((1U << EF_DATA_EF_KEY_SLOT_2_W1_LEN) - 1) << EF_DATA_EF_KEY_SLOT_2_W1_POS)
#define EF_DATA_EF_KEY_SLOT_2_W1_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_2_W1_LEN) - 1) << EF_DATA_EF_KEY_SLOT_2_W1_POS))

/* 0x44 : ef_key_slot_2_w2 */
#define EF_DATA_EF_KEY_SLOT_2_W2_OFFSET (0x44)
#define EF_DATA_EF_KEY_SLOT_2_W2        EF_DATA_EF_KEY_SLOT_2_W2
#define EF_DATA_EF_KEY_SLOT_2_W2_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_2_W2_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_2_W2_MSK    (((1U << EF_DATA_EF_KEY_SLOT_2_W2_LEN) - 1) << EF_DATA_EF_KEY_SLOT_2_W2_POS)
#define EF_DATA_EF_KEY_SLOT_2_W2_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_2_W2_LEN) - 1) << EF_DATA_EF_KEY_SLOT_2_W2_POS))

/* 0x48 : ef_key_slot_2_w3 */
#define EF_DATA_EF_KEY_SLOT_2_W3_OFFSET (0x48)
#define EF_DATA_EF_KEY_SLOT_2_W3        EF_DATA_EF_KEY_SLOT_2_W3
#define EF_DATA_EF_KEY_SLOT_2_W3_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_2_W3_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_2_W3_MSK    (((1U << EF_DATA_EF_KEY_SLOT_2_W3_LEN) - 1) << EF_DATA_EF_KEY_SLOT_2_W3_POS)
#define EF_DATA_EF_KEY_SLOT_2_W3_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_2_W3_LEN) - 1) << EF_DATA_EF_KEY_SLOT_2_W3_POS))

/* 0x4C : ef_key_slot_3_w0 */
#define EF_DATA_EF_KEY_SLOT_3_W0_OFFSET (0x4C)
#define EF_DATA_EF_KEY_SLOT_3_W0        EF_DATA_EF_KEY_SLOT_3_W0
#define EF_DATA_EF_KEY_SLOT_3_W0_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_3_W0_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_3_W0_MSK    (((1U << EF_DATA_EF_KEY_SLOT_3_W0_LEN) - 1) << EF_DATA_EF_KEY_SLOT_3_W0_POS)
#define EF_DATA_EF_KEY_SLOT_3_W0_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_3_W0_LEN) - 1) << EF_DATA_EF_KEY_SLOT_3_W0_POS))

/* 0x50 : ef_key_slot_3_w1 */
#define EF_DATA_EF_KEY_SLOT_3_W1_OFFSET (0x50)
#define EF_DATA_EF_KEY_SLOT_3_W1        EF_DATA_EF_KEY_SLOT_3_W1
#define EF_DATA_EF_KEY_SLOT_3_W1_POS    (0U)
#define EF_DATA_EF_KEY_SLOT_3_W1_LEN    (32U)
#define EF_DATA_EF_KEY_SLOT_3_W1_MSK    (((1U << EF_DATA_EF_KEY_SLOT_3_W1_LEN) - 1) << EF_DATA_EF_KEY_SLOT_3_W1_POS)
#define EF_DATA_EF_KEY_SLOT_3_W1_UMSK   (~(((1U << EF_DATA_EF_KEY_SLOT_3_W1_LEN) - 1) << EF_DATA_EF_KEY_SLOT_3_W1_POS))

